"""Якщо вхідний список порожній, то:
  Повертаємо порожній список
Якщо перший елемент списку є списком, то:
  Отримуємо перший список, рекурсивно викликавши функцію з першим елементом списку
  Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
  Повертаємо конкатенацію двох списків
Якщо перший елемент списку не є списком, то:
  Отримуємо перший список із першого елемента списку
  Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
  Повертаємо конкатенацію двох списків"""


def flatten(data):
    result = []
    if not data:
        return []

    if type(data[0]) == list:
        flatten(data[1:])
        result = flatten(data[0]) + flatten(data[1:])
        return result
    return data[:1] + flatten(data[1:])


data = [1, 2, [3, 4, [5, 6]], 7]
print(flatten(data))
